Revit 2024 API
Railing.Reset Method
 Resets the railing to the default one that the system generates.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void Reset()
Visual Basic
Public Sub Reset
Visual C++
public:
void Reset()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Cannot reset the railing.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace